www/commentry.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-06 Sun 19:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org55fa7f6">1. Representng puzzles computationally.</a></li>
</ul>
</div>
</div>
<div id="outline-container-org55fa7f6" class="outline-2">
<h2 id="org55fa7f6"><span class="section-number-2">1</span> Representng puzzles computationally.</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-text">|--------+--------+--------+--------+--------|
| corner | edge   | edge   | edge   | corenr |
|--------+--------+--------+--------+--------|
| edge   | center | center | center | edge   |
|--------+--------+--------+--------+--------|
| edge   | center | center | center | edge   |
|--------+--------+--------+--------+--------|
| edge   | center | center | cneter | edge   |
|--------+--------+--------+--------+--------|
| corner | edge   | edge   | edge   | corner |
|--------+--------+--------+--------+--------|
</pre>
</div>

<p>
However this method would not work on an icosahedron.
</p>

<p>
An alternative approach to this wold be to create a net data structure
of each shape, and then use a function that will then create the
adjacent faces structure from the net as input.
</p>

<p>
The <i>makeNet</i> function, takes the number of sides and faces of a given
shape and returns its net as a two dimensional arrary with each sub-arry
being a face and each item a point that connects faces.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5317ac;">def</span> <span style="color: #721045;">makeNet</span>(faces: <span style="color: #8f0075;">int</span>, sides: <span style="color: #8f0075;">int</span>) -&gt; <span style="color: #8f0075;">list</span>[<span style="color: #8f0075;">list</span>[<span style="color: #8f0075;">int</span>]]:
    <span style="color: #2a486a;">'''New faces that are added to net can't have points or share pairs</span>
<span style="color: #2a486a;">of points that are in the previous two lists.  Adjacent points in the</span>
<span style="color: #2a486a;">list are adjacent on the face.</span>

<span style="color: #2a486a;">When adding a new face, look for two adjacend points are not in</span>
<span style="color: #2a486a;">fullPairs.  Add points n+1 and n+2 to the face and poitns where n is the</span>
<span style="color: #2a486a;">nth point in points.  Repeat until all faces have been created.</span>

<span style="color: #2a486a;">    '''</span>
    <span style="color: #00538b;">net</span> = [<span style="color: #8f0075;">list</span>(<span style="color: #8f0075;">range</span>(sides))]
    <span style="color: #00538b;">points</span> = <span style="color: #8f0075;">list</span>(<span style="color: #8f0075;">range</span>(sides)) <span style="color: #505050;"># </span><span style="color: #505050;">List of points that are used by any of the faces.</span>
    <span style="color: #00538b;">fullPoints</span> = []             <span style="color: #505050;"># </span><span style="color: #505050;">List of all points that are used by 3 faces.</span>
    <span style="color: #00538b;">pairs</span> = []                  <span style="color: #505050;"># </span><span style="color: #505050;">List of sets of 2 points used by 2 faces.</span>
    <span style="color: #505050;"># </span><span style="color: #505050;">freeFaces = []  # List of faces that don't have another face attatched to each of its sides.</span>

    <span style="color: #5317ac;">def</span> <span style="color: #721045;">findFullPoints</span>(net: <span style="color: #8f0075;">list</span>[<span style="color: #8f0075;">list</span>[<span style="color: #8f0075;">int</span>]]) -&gt; <span style="color: #8f0075;">list</span>[<span style="color: #8f0075;">int</span>]:
        <span style="color: #00538b;">points</span> = [point <span style="color: #5317ac;">for</span> shape <span style="color: #5317ac;">in</span> net <span style="color: #5317ac;">for</span> point <span style="color: #5317ac;">in</span> shape]
        <span style="color: #5317ac;">return</span> <span style="color: #8f0075;">set</span>(point <span style="color: #5317ac;">for</span> point <span style="color: #5317ac;">in</span> points <span style="color: #5317ac;">if</span> points.count(point) == 3)

    <span style="color: #5317ac;">while</span> <span style="color: #8f0075;">len</span>(net) &lt; faces:
        <span style="color: #505050;"># </span><span style="color: #505050;">print(0)</span>
        <span style="color: #5317ac;">for</span> face <span style="color: #5317ac;">in</span> net:
            <span style="color: #505050;"># </span><span style="color: #505050;">print(1)</span>
            <span style="color: #5317ac;">for</span> i <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span>(<span style="color: #8f0075;">len</span>(face)):
                <span style="color: #505050;"># </span><span style="color: #505050;">print(2)</span>
                <span style="color: #00538b;">p1</span> = face[i-1]
                <span style="color: #00538b;">p2</span> = face[i]
                <span style="color: #5317ac;">if</span> {p1, p2} <span style="color: #5317ac;">not</span> <span style="color: #5317ac;">in</span> pairs <span style="color: #5317ac;">and</span> p1 <span style="color: #5317ac;">not</span> <span style="color: #5317ac;">in</span> fullPoints <span style="color: #5317ac;">and</span> p2 <span style="color: #5317ac;">not</span> <span style="color: #5317ac;">in</span> fullPoints:
                    <span style="color: #505050;"># </span><span style="color: #505050;">print(3)j</span>
                    <span style="color: #505050;"># </span><span style="color: #505050;">Found valid pair of points.</span>
                    <span style="color: #00538b;">face</span> = [p1,p2]
                    pairs.append(<span style="color: #8f0075;">set</span>(face))
                    <span style="color: #5317ac;">for</span> j <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span>(sides-2):
                        <span style="color: #505050;"># </span><span style="color: #505050;">Two time for a cube.</span>
                        points.append(points[-1]+1)
                        face.append(points[-1])
                    net.append(face)
                    <span style="color: #00538b;">fullPoints</span> = findFullPoints(net)
        <span style="color: #5317ac;">print</span>(<span style="color: #8f0075;">len</span>(net),faces)

    <span style="color: #5317ac;">return</span> net
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-12-06 Sun 19:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
